04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/LBend/constant/momentumTransport.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    model    kEpsilon;

    turbulence      on;
}

LES
{
    model    Smagorinsky;

    turbulence      on;

    delta cubeRootVol;

    cubeRootVol
    {
        deltaCoeff 1;
    }
}


// ************************************************************************* //
